# shubham birari (ML16)

In [ ]:
#Q. use the bank data and create different hypothesis

In [4]:
import pandas as pd
db = pd.read_csv(r"C:/Users/ers\shubh\symbiosis ml16\pandas\bank.csv")

In [5]:
db.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

In [6]:
db.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [7]:
db.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

In [8]:
db.marital.unique()

array(['married', 'single', 'divorced'], dtype=object)

In [9]:
db['marital'].replace('married',1,inplace=True)
db['marital'].replace('single',2,inplace=True)
db['marital'].replace('divorced',3,inplace=True)

In [12]:
db.education.unique()

array([1, 2, 4, 3], dtype=int64)

In [13]:
db['education'].replace('primary',1,inplace=True)
db['education'].replace('secondary',2,inplace=True)
db['education'].replace('unknown',3,inplace=True)
db['education'].replace('tertiary',4,inplace=True)

In [14]:
db.loan.unique()

array(['no', 'yes'], dtype=object)

In [15]:
db['loan'].replace('yes',1,inplace=True)
db['loan'].replace('no',2,inplace=True)

In [16]:
db

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,1,1,no,1787,no,2,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,1,2,no,4789,yes,1,cellular,11,may,220,1,339,4,failure,no
2,35,management,2,4,no,1350,yes,2,cellular,16,apr,185,1,330,1,failure,no
3,30,management,1,4,no,1476,yes,1,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,1,2,no,0,yes,2,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,1,2,no,-333,yes,2,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,1,4,yes,-3313,yes,1,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,1,2,no,295,no,2,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,1,2,no,1137,no,2,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,2,4,no,1136,yes,1,cellular,3,apr,345,2,249,7,other,no

In [17]:
import scipy.stats as stats

In [18]:
# H0: loan is independents 
# H1 : loan is dependents 
marital = pd.crosstab(db['marital'],db['loan']) ; marital

loan       1     2
marital
1        453  2344
2        148  1048
3         90   438

In [19]:
var = stats.chi2_contingency(marital)
print("Test Statistic    : ",var[0])
print("P-value           :  {:0.9f}".format(var[1]))
print("Degree of freedom : ",var[2])
significance_level=0.05
if var[1]<= significance_level: 
    print('Reject NULL HYPOTHESIS') 
else: 
    print('ACCEPT NULL HYPOTHESIS')

Test Statistic    :  10.880344181890264
P-value           :  0.004338737
Degree of freedom :  2
Reject NULL HYPOTHESIS

In [26]:
## loan is dependent on marital

In [24]:
edu = pd.crosstab(db['education'],db['loan']) ;edu

loan         1     2
education
1           94   584
2          416  1890
3            7   180
4          174  1176

In [25]:
var = stats.chi2_contingency(edu)
print("Test Statistic    : ",var[0])
print("P-value           :  {:0.9f}".format(var[1]))
print("Degree of freedom : ",var[2])
significance_level=0.05
if var[1]<= significance_level: 
    print('Reject NULL HYPOTHESIS') 
else: 
    print('ACCEPT NULL HYPOTHESIS')

Test Statistic    :  39.797883970759884
P-value           :  0.000000012
Degree of freedom :  3
Reject NULL HYPOTHESIS

In [45]:
#loan is dpendent on education

In [46]:
##Q. create sample of 40 random values for balance and compare the same with population

In [ ]:
#H0 : mean balance is qequal to population mean
#H1 : mean balanvce is not equaal to population mean

In [34]:
data = db['balance'].sample(n = 40 , random_state= 31)
pop_mean = db['balance'].mean()
balance_mean = data.mean()
tval,pval=stats.ttest_1samp(data,pop_mean)
print('tval:' , tval)
print('pval:',pval)
print('population mean:',pop_mean)
print('balance mean', balance_mean)
significance_level = 0.05
if pval <= significance_level: 
    print('Reject NULL HYPOTHESIS') 
else: 
    print('ACCEPT NULL HYPOTHESIS')

tval: -0.17401512754195092
pval: 0.8627537237678814
population mean: 1422.6578190665782
balance mean 1364.525
ACCEPT NULL HYPOTHESIS

In [33]:
#Q. perform Anova test to compare job wise duration is same or not

In [41]:
db['job'].unique()

array(['unemployed', 'services', 'management', 'blue-collar',
       'self-employed', 'technician', 'entrepreneur', 'admin.', 'student',
       'housemaid', 'retired', 'unknown'], dtype=object)

In [44]:
job_types = []
for job in db['job'].unique():
    job_types.append(db[db['job']==job]['duration'])
fval,pval = stats.f_oneway(*job_types)
print('fvalue:' , fval)
print('pvalue:', pval)

fvalue: 1.7258910006923238
pvalue: 0.06174565640401985

In [45]:
#Q. check average balance of primary education is same as  average balance of secondary education

In [47]:
db1 = pd.read_csv(r"C:\Users\shubh\symbiosis ml16\pandas\bank.csv")

In [49]:
    db1['education'].unique()

array(['primary', 'secondary', 'tertiary', 'unknown'], dtype=object)

In [61]:
primary_edu = db1[db1['education']== 'primary']
primary_balance_mean = primary_edu['balance'].mean()
secondary_edu = db1[db1['education']=='secondary']
secondary_balance_mean = secondary_edu['balance'].mean()
#compare mean
tval,pval = stats.ttest_ind(primary_edu['balance'],secondary_edu['balance'])
print('mean of balance of primary edu:',primary_balance_mean)
print('mean of balance of secondary edu:' , secondary_balance_mean)
print('t value:', tval)
print('p value:' , p_val)

mean of balance of primary edu: 1411.5442477876106
mean of balance of secondary edu: 1196.8143972246314
t value: 1.7762783701327036
p value: 1.0

In [62]:
#Q. compare balance of customer having housing as 'yes'  and column - loan as 'yes

In [84]:
housing_loan=db1[(db1['housing']=='yes') & (db1['loan']=='yes')]
housing_loan_balance= housing_loan[housing_loan['balance'].notnull()]['balance']
housing_noloan_balance = db1[(db1['housing']=='no') & (db1['loan'] == 'yes')]['balance']
tval , pval= stats.ttest_ind(housing_loan_balance,housing_noloan_balance)
print('t value:',tval)
print('p value:', pval)

t value: -0.11214748589139498
p value: 0.9107391304612914